testfile/performance-test-2025-04-13T202430836Z.txt
     ✓ Status is 200
     ✓ Has session_id
     ✓ Has anonymized_text

     checks.........................: 100.00% ✓ 45       ✗ 0  
     data_received..................: 192 kB  47 kB/s
     data_sent......................: 188 kB  46 kB/s
     http_req_blocked...............: avg=107.69µs min=0s      med=0s       max=1.09ms  p(90)=311.39µs p(95)=692.24µs
     http_req_connecting............: avg=34.6µs   min=0s      med=0s       max=519µs   p(90)=0s       p(95)=155.69µs
   ✓ http_req_duration..............: avg=653.66ms min=19.37ms med=291.73ms max=2.93s   p(90)=1.94s    p(95)=2.3s    
       { expected_response:true }...: avg=653.66ms min=19.37ms med=291.73ms max=2.93s   p(90)=1.94s    p(95)=2.3s    
   ✓ http_req_failed................: 0.00%   ✓ 0        ✗ 15 
     http_req_receiving.............: avg=269.72µs min=0s      med=0s       max=752.3µs p(90)=673.5µs  p(95)=735.49µs
     http_req_sending...............: avg=138.86µs min=0s      med=0s       max=527.9µs p(90)=520.74µs p(95)=523.7µs 
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s       max=0s      p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=653.25ms min=18.86ms med=291.73ms max=2.93s   p(90)=1.94s    p(95)=2.3s    
     http_reqs......................: 15      3.649869/s
     iteration_duration.............: avg=655.24ms min=20.44ms med=294.88ms max=2.94s   p(90)=1.95s    p(95)=2.3s    
     iterations.....................: 15      3.649869/s
     vus............................: 1       min=1      max=3
     vus_max........................: 3       min=3      max=3